Revit 2020 API
LayeredNdfType Enumeration
 The enumerated type representing the permitted values for the asset property "LayeredNdfType" from the "PrismLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public enum LayeredNdfType
Visual Basic
Public Enumeration LayeredNdfType
Visual C++
public enum class LayeredNdfType
Members
Member name | Description
Beckmann
Ggx
See Also
Autodesk.Revit.DB.Visual Namespace